Backend/app/controllers/cryptocurrencies_controller.rb

  def index
    @cryptocurrencies = Cryptocurrency.all
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies"