Backend/app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "lastname", "jti") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "wallets" ("clp", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["clp", 63145], ["user_id", 2], ["created_at", "2020-10-30 06:04:38.290546"], ["updated_at", "2020-10-30 06:04:38.290546"]]
INSERT INTO "balances" ("amount", "wallet_id", "market_id", "cryptocurrency_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 0.0], ["wallet_id", 2], ["market_id", 1], ["cryptocurrency_id", 1], ["created_at", "2020-10-30 06:04:38.345094"], ["updated_at", "2020-10-30 06:04:38.345094"]]
INSERT INTO "balances" ("amount", "wallet_id", "market_id", "cryptocurrency_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 0.0], ["wallet_id", 2], ["market_id", 1], ["cryptocurrency_id", 2], ["created_at", "2020-10-30 06:04:38.399515"], ["updated_at", "2020-10-30 06:04:38.399515"]]
---
  def create
    build_resource(sign_up_params)
    resource.save
    @clp = rand(10000..100000)
    @new_user = resource
    @user_wallet = Wallet.new(clp: @clp, user_id: resource.id)
    @user_wallet.save
    @user_balance_btf = Balance.new(amount: 0, wallet_id: @user_wallet.id, market_id: 1, cryptocurrency_id: 1)
    @user_balance_btf.save
    @user_balance_bth = Balance.new(amount: 0, wallet_id: @user_wallet.id, market_id: 1, cryptocurrency_id: 2)
    @user_balance_bth.save