Backend/app/controllers/transactions_controller.rb

  def set_create_params
    @wallet = current_user.wallet
    @new_amount = @wallet.clp + transaction_params[:amount]
    @transaction_amount = transaction_params[:amount]
    @crypto = Cryptocurrency.find_by(name: transaction_params[:cryptocurrency_name])
    @market = Market.find_by(id: 1)
    @balance = @wallet.balances.where(cryptocurrency_id: @crypto.id).first
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."name" = $1 LIMIT $2  [["name", "BTF"], ["LIMIT", 1]]
SELECT "markets".* FROM "markets" WHERE "markets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = $1 AND "balances"."cryptocurrency_id" = $2 ORDER BY "balances"."id" ASC LIMIT $3  [["wallet_id", 2], ["cryptocurrency_id", 1], ["LIMIT", 1]]

  def buy_btf
    @wallet.update({ clp: @new_amount })
    @updated_balance = @wallet.balances[0].amount + @transaction_amount * -1 / @crypto.selling_price
    @wallet.balances[0].update({ amount: @updated_balance })
    @new_crypto_amount = @market.btf + @transaction_amount / @crypto.selling_price
    @market.update({ btf: @new_crypto_amount })
    @crypto.update({ selling_price: @crypto.selling_price * (1 + 0.03) })
    @transaction = Transaction.create(amount: transaction_params[:amount], cryptocurrency_id: @crypto.id, wallet_id: @wallet.id)
---
UPDATE "wallets" SET "clp" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["clp", 33145], ["updated_at", "2020-10-30 06:05:04.322828"], ["id", 2]]
UPDATE "balances" SET "amount" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["amount", 14.285714285714286], ["updated_at", "2020-10-30 06:05:04.372311"], ["id", 3]]
UPDATE "markets" SET "btf" = $1, "updated_at" = $2 WHERE "markets"."id" = $3  [["btf", 899985.7142857143], ["updated_at", "2020-10-30 06:05:04.381225"], ["id", 1]]
INSERT INTO "transactions" ("amount", "wallet_id", "cryptocurrency_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", -30000.0], ["wallet_id", 2], ["cryptocurrency_id", 1], ["created_at", "2020-10-30 06:05:04.420837"], ["updated_at", "2020-10-30 06:05:04.420837"]]

  def buy_bth
    @wallet.update({ clp: @new_amount })
    @updated_balance = @wallet.balances[1].amount + @transaction_amount * -1 / @crypto.selling_price
    @wallet.balances[1].update({ amount: @updated_balance })
    @new_crypto_amount = @market.bth + @transaction_amount / @crypto.selling_price
    @market.update({ bth: @new_crypto_amount })
    @crypto.update({ selling_price: @crypto.selling_price * (1 + 0.03) })
    @transaction = Transaction.create(amount: transaction_params[:amount], cryptocurrency_id: @crypto.id, wallet_id: @wallet.id)
---
UPDATE "wallets" SET "clp" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["clp", 30145], ["updated_at", "2020-10-30 06:05:17.564869"], ["id", 2]]
UPDATE "balances" SET "amount" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["amount", 1.6666666666666667], ["updated_at", "2020-10-30 06:05:17.588168"], ["id", 4]]
UPDATE "markets" SET "bth" = $1, "updated_at" = $2 WHERE "markets"."id" = $3  [["bth", 999998.3333333334], ["updated_at", "2020-10-30 06:05:17.596818"], ["id", 1]]
INSERT INTO "transactions" ("amount", "wallet_id", "cryptocurrency_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", -3000.0], ["wallet_id", 2], ["cryptocurrency_id", 2], ["created_at", "2020-10-30 06:05:17.622556"], ["updated_at", "2020-10-30 06:05:17.622556"]]

  def sell_handler
    if @crypto.name == "BTF"
      @new_crypto_amount = @market.btf + @transaction_amount / @crypto.buying_price
      @market.update({ btf: @new_crypto_amount })

    else
      @new_crypto_amount = @market.bth + @transaction_amount / @crypto.buying_price
      @market.update({ bth: @new_crypto_amount })

    end

    @crypto.update({ buying_price: @crypto.buying_price * (1 - 0.03) })
    @transaction = Transaction.create(amount: transaction_params[:amount], cryptocurrency_id: @crypto.id, wallet_id: @wallet.id)
---
UPDATE "markets" SET "btf" = $1, "updated_at" = $2 WHERE "markets"."id" = $3  [["btf", 899985.719285714], ["updated_at", "2020-10-30 06:05:31.808027"], ["id", 1]]
UPDATE "markets" SET "bth" = $1, "updated_at" = $2 WHERE "markets"."id" = $3  [["bth", 999998.9999999997], ["updated_at", "2020-10-30 06:05:49.861276"], ["id", 1]]
INSERT INTO "transactions" ("amount", "wallet_id", "cryptocurrency_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 10.0], ["wallet_id", 2], ["cryptocurrency_id", 1], ["created_at", "2020-10-30 06:05:31.833882"], ["updated_at", "2020-10-30 06:05:31.833882"]]

  def update_amounts
    @wallet.update({ clp: @new_amount })
    @updated_balance = @balance.amount - @transaction_amount / @crypto.buying_price
    @balance.update({ amount: @updated_balance })
---
UPDATE "wallets" SET "clp" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["clp", 30155], ["updated_at", "2020-10-30 06:05:31.768528"], ["id", 2]]
UPDATE "balances" SET "amount" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["amount", 14.2807142857143], ["updated_at", "2020-10-30 06:05:31.801828"], ["id", 3]]